package PLMS.Enums;

/**
 * Created by IntelliJ IDEA.
 */
public enum EnumFn {
    F01(1),F02(2),F03(3),F04(4),F05(5),F06(6),F07(7),F08(8),
    F09(9),F10(10),F11(11),F12(12),F13(13),F14(14),F15(15),F16(16),
    F17(17),F18(18),F19(19),F20(20),F21(21),F22(22),F23(23),F24(24),
    F25(25),F26(26),F27(27),F28(28),F29(29),F30(30),F31(31),F32(32),
    F33(33),f34(34),F35(35),F36(36),F37(37),F38(38),F39(39),F40(40),
    F41(41),F42(42),F43(43),F44(44),F45(45),F46(46),F47(47),F48(48),
    F49(49),F50(50),F51(51),F52(52),F53(53),F54(54),F55(55),F56(56),
    F57(57),F58(58),F59(59),F60(60),F61(61),F62(62),F63(63),F64(64),
    F65(65),F66(66),F67(67),F68(68),F69(69),F70(70),F71(71),F72(72),
    F73(73),F74(74),F75(75),F76(76),F77(77),F78(78),F79(79),F80(80),
    F81(81),F82(82),F83(83);
    // ------------------------------------
    private  int value;
    private EnumFn(int v)
    {
        this.value=v;
    }
    public int valueOf()
    {
        return  value;
    }
    // 根据值，找对应的枚举值
    public static EnumFn get(int code) {
        for(EnumFn s : values()) {
            if(s.value == code) return s;
        }
        return null;
    }

}
